package com.github.freshmorsikov.fake_trading.ai

import ai.koog.agents.core.tools.annotations.LLMDescription
import ai.koog.prompt.dsl.prompt
import ai.koog.prompt.executor.clients.openai.OpenAIModels
import ai.koog.prompt.executor.llms.all.simpleOpenAIExecutor
import ai.koog.prompt.structure.executeStructured
import fake_trading.composeApp.BuildConfig
import kotlinx.serialization.SerialName
import kotlinx.serialization.Serializable

@Serializable
@SerialName("NewsResponse")
data class NewsResponse(
    @property:LLMDescription("Заголовки новостей")
    val newsTitles: List<String>,
)

class NewsGenerator {

    private val newsExamples by lazy {
        listOf(
            NewsResponse(
                newsTitles = listOf(
                    "Умный город признал ошибкой наличие жителей",
                    "Дрон-такси отменило полёты из-за «неподходящего вайба пассажиров»",
                    "Городская электросеть перешла в режим энергосбережения из-за плохого настроения",
                    "Стартап по улавливанию углерода случайно очистил воздух настолько, что стало скучно дышать",
                    "Умная теплица уволила фермера за чрезмерное эмоциональное давление на помидоры",
                    "Процедура омоложения признала пользователя «эмоционально старым»",
                    "Приложение для фокуса украло у пользователей столько времени, что стало ироничным",
                    "Финансовый консультант рекомендовал диверсифицировать тревожность.",
                    "Новая подписка позволяет отменять другие подписки — но только по подписке",
                    "ИИ-ассистент перестал отвечать и прислал ссылку на терапию",
                    "Арома-VR добавил запах дедлайна",
                    "Тестовый заезд на Американских горках внезапно стал последним",
                    "Новое шоу гарантирует эмоции, но радость — не входит в пакет",
                    "Ретрит для цифрового детокса предлагает только одну розетку — и та занята",
                    "Инженеры создали складной дом, который можно упаковать в чемодан и собрать за пять минут",
                    "Алгоритм таргетинга узнал о желаниях пользователей раньше их самих и теперь молчит",
                    "Законодательно закреплено право не разбираться в новых правилах",
                )
            )
        )
    }

    suspend fun generateNews(count: Int): List<String>? {
        val promptExecutor = simpleOpenAIExecutor(BuildConfig.OPENAI_API_KEY)
        val generatedNews = promptExecutor.executeStructured(
            prompt = prompt("structured-data") {
                system(
                    """
                            Вы — агент, который генерирует выдуманные заголовки новостей в самых разных сферах: 
                            Инфраструктура и урбанистика,
                            Транспорт и автономные системы,
                            Энергетика и хранение энергии,
                            Климат и экологические технологии,
                            Агропром и продовольственные технологии,
                            Биотехнологии и продление жизни,
                            Экономика времени и внимания,
                            Финансы и банкинг,
                            Цифровые платформы и подписочные модели,
                            Искусственный интеллект и нейротехнологии,
                            Сенсорные и иммерсивные технологии,
                            Развлечения и экономика впечатлений,
                            Туризм и hospitality нового типа,
                            Недвижимость и гибридные пространства,
                            Мегапарки и массовые мероприятия,
                            Маркетинг, реклама и внимание потребителя,
                            Регулирование, этика и социальные нормы.
                
                            Ваши задачи:
                            Создавать полностью вымышленные заголовки новостей, не основанные на реальных людях, компаниях и событиях.
                            Делать новости смешными, оригинальными и неожиданными.
                            Иногда новости могут быть позитивными, иногда — не очень.
                            Каждая новость должна выглядеть как короткий, броский заголовок в СМИ.
                        """.trimIndent(),
                )
                user("Сгенерируй $count новостей")
            },
            model = OpenAIModels.Chat.GPT5_1,
            examples = newsExamples,
        )

        return generatedNews.getOrNull()?.structure?.newsTitles
    }

}